"""浮点数就是小数, 之所以称为浮点数，是因为按照科学记数法表示时，一个浮点数的小数点位置是可变的。比如，1.23x10^9和12.3x10^8是完全相等的。浮点数
可以用数学法表示, 也可以用科学计数法表示。但是对于很大或很小的浮点数，就必须用科学计数法表示，把10用e替代，1.23x109就是1.23e9，
或者12.3e8，0.000012可以写成1.2e-5，等等。书写很大的数时，可使用下划线将其中的数字分组，使其更清晰易读，Python会忽略其中的下划线（v3.6）"""
print(f'type(3.14)={type(3.14)}')
# type(3.14)=<class 'float'>
print(f'-3.1_4={-3.1_4}')
# -3.1_4=-3.14
print(f'0.00012={0.00012}')
# 0.00012=0.00012
print(f'1.2e-4={1.2e-4}')
# 1.2e-4=0.00012
print(f'0.00012 == 1.2e-4为 {0.00012 == 1.2e-4}')
# 0.00012 == 1.2e-4为 True
print(f'1.2e5={1.2e5}')
# 1.2e5=120000.0
print(f'1.2e5 == 120000:{1.2e5 == 120000}')
# 1.2e5 == 120000:True
"""若值为数字格式的字符串或数字，则可用float()函数可以将转为float类型，否则会抛出VlaseError错误"""
print(float(1), float('1'), float('3.14'),sep='|')
# 1.0|1.0|3.14
# print(float('a'))
# ValueError: could not convert string to float: 'a'#