def get_contacts_position_new(col):
    list = ['设计', '采购', '运营', '财务', '产品', '销售', '职能', '客服', '市场', '技术', '高管']
    position_new = {'设计': ['设计', '美工', 'UI'],
                    '采购': ['采购'],
                    '运营': ['运营', '策划'],
                    '财务': ['财务', '审计', '预算', '会计'],
                    '产品': ['产品', '项目'],
                    '销售': ['客户', '销售', '咨询', '顾问', '渠道', '商务', '区域'],
                    '高管': ['法人', '法定负责人', '董事', '监事', '总监', '经理', '合伙人', '秘书', '店长', '所长', '理事', '主任', '主管', '个体'],
                    '职能': ['HR', '培训', '人事', '人力', '行政', '招聘', '后勤', '值班', '助理', '讲师', '招生', '管理', '仓'],
                    '客服': ['客服', '服务'],
                    '市场': ['营销', '公关', '品牌', '项目', '市场', '广告', '推广', '网络'],
                    '技术': ['测试', '开发', '架构师', '专家', '员', '技', '师', '记者', '工']

                    }
    if col:
        for l in list:
            for p in position_new[l]:
                if p in col:
                    return l
    return '其他'

print(get_contacts_position_new('监事助理'))